app/controllers/posts_controller.rb

	def create
		# render text: params[:post].inspect
		@post = Post.new(params[:post].permit(:title, :url, :description))
		if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 14 Dec 2013 18:10:37 UTC +00:00], ["description", ""], ["title", "e"], ["updated_at", Sat, 14 Dec 2013 18:10:37 UTC +00:00], ["url", ""]]